---
kind: property
id: P:Autodesk.Revit.DB.RenderingSettings.UsesRegionRendering
source: html/f8f675b2-bed7-1c2c-acab-cfb4efce0ce3.htm
---
# Autodesk.Revit.DB.RenderingSettings.UsesRegionRendering Property

The bool value that indicates whether to use region rendering.

## Syntax (C#)
```csharp
public bool UsesRegionRendering { get; set; }
```